zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommi2ct.h
/*
 * Copyright (c) 2024, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_unicommi2ct.h
 *  @brief      Unified Communication Module (UNICOMM) - Inter-Integrated Circuit Target (I2CT) Driver Library
 *              统一通信模块（UNICOMM）I2C 目标设备（I2CT）驱动库，提供 I2C 从机模式的完整配置与数据传输接口。
 *  @defgroup   UNICOMMI2CT Unified Communication Module (UNICOMM) - Inter-Integrated Circuit Target (I2CT)
 *
 *  @anchor ti_dl_dl_unicommi2ct_Overview
 *  # Overview
 *
 *  Unified Communication Module Inter-Integrated Circuit Target Driver Library allows
 *  full configuration of the UNICOMM I2CT module.
 *
 *  This Inter-Integrated Circuit Target (I2CT) module provides a standardized
 *  interface to transfer data, as a target, between devices and other external
 *  devices with the I2C interface.
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup UNICOMMI2CT
 * @{
 */
#ifndef ti_dl_dl_unicommi2ct__include
#define ti_dl_dl_unicommi2ct__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>
#include <ti/driverlib/dl_unicomm.h>

#ifdef __MCU_HAS_UNICOMMI2CT__

#ifdef __cplusplus
extern "C"
{
#endif

    /* clang-format off */

/*!
 * @brief I2CT number of bytes which could be put into the TX FIFO
 *        TX FIFO 最大容量（字节数），由器件头文件中的 UNICOMMI2CT_SYS_FENTRIES 决定。
 *
 * This variable is device specific and is calculated using the system parameter
 * UNICOMMI2CT_SYS_FENTRIES defined in each devices header file.
*/
#define DL_I2CT_TX_FIFO_COUNT_MAXIMUM          ((uint32_t)UNICOMMI2CT_SYS_FENTRIES << 8)

/*!
 * @brief I2CT number of bytes which could be put into the RX FIFO
 *        RX FIFO 最大容量（字节数），由器件头文件中的 UNICOMMI2CT_SYS_FENTRIES 决定。
 *
 * This variable is device specific and is calculated using the system parameter
 * UNICOMMI2CT_SYS_FENTRIES defined in each devices header file.
*/
#define DL_I2CT_RX_FIFO_COUNT_MAXIMUM               ((uint32_t)UNICOMMI2CT_SYS_FENTRIES)

/** @addtogroup DL_I2CT_STATUS
 *  @{
 */

/*!
 * @brief Indicates the address for which address match happened
 *        地址匹配标志，指示匹配到的地址。
 */
#define DL_I2CT_STATUS_ADDRESS_MATCH             (UNICOMMI2CT_SR_ADDRMATCH_MASK)

/*!
 * @brief I2CT Stale TX FIFO
 *        TX FIFO 数据过期标志（上次事务未清空 FIFO）。
 *
 * Set = The TX FIFO data is stale. This occurs when the TX FIFO was not
 *   emptied during the previous I2CT transaction
 * Clear = The TX FIFO data is not stale
 */
#define DL_I2CT_STATUS_STALE_TX_FIFO          (UNICOMMI2CT_SR_STALE_TXFIFO_MASK)

/*!
 * @brief I2CT TX Mode
 *        I2CT 发送模式标志。
 *
 * Set = is in the TX_DATA, TX_ACK, TX_WAIT, or ADDR_ACK state with the
 *   bus direction set to read
 * Clear = is not in the TX_DATA, TX_ACK, TX_WAIT, or ADDR_ACK state
 *   with the bus direction set to read
 */
#define DL_I2CT_STATUS_TX_MODE                      (UNICOMMI2CT_SR_TXMODE_MASK)

/*!
 * @brief I2CT Bus Busy
 *        I2CT 总线忙标志。
 *
 * Set = The I2CT bus is busy. This is cleared on a timeout
 * Clear = The I2CT bus is not busy. This bit is cleared when a STOP condition is
 *   detected on the bus.
 */
#define DL_I2CT_STATUS_BUS_BUSY                     (UNICOMMI2CT_SR_BUSBSY_MASK)

/*!
 * @brief I2CT RX Mode
 *        I2CT 接收模式标志。
 *
 * Set = is in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK
 *   state with the bus direction set to write
 * Clear = is not in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK
 *   state with the bus direction set to write
 */
#define DL_I2CT_STATUS_RX_MODE                      (UNICOMMI2CT_SR_RXMODE_MASK)


/*!
 * @brief Direction of I2CT Quick Command
 *        快速命令方向标志（仅 QCMDST 置位时有效）。
 * Only valid when QCMDST is set. @sa DL_I2CT_STATUS_QUICK_COMMAND_STATUS.
 * Set = Quick command was a read
 * Clear = Quick command was a write
 */
#define DL_I2CT_STATUS_QUICK_COMMAND_READ_WRITE     (UNICOMMI2CT_SR_QCMDRW_MASK)

/*!
 * @brief Status of I2CT Quick Command
 *        快速命令状态标志。
 * @sa DL_I2CT_STATUS_QUICK_COMMAND_READ_WRITE.
 * Set = Last transaction was a Quick Comand transaction
 * Clear = Last transaction was normal or has not occurred
 */
#define DL_I2CT_STATUS_QUICK_COMMAND_STATUS         (UNICOMMI2CT_SR_QCMDST_MASK)

/*!
 * @brief I2CT Own Address Alternate Matched
 *        备用自身地址匹配标志。
 */
#define DL_I2CT_STATUS_OWN_ADDR_ALTERNATE_MATCHED  (UNICOMMI2CT_SR_OAR2SEL_MASK)

/*!
 * @brief I2CT Transmit Request
 *        I2CT 发送请求标志。
 */
#define DL_I2CT_STATUS_TRANSMIT_REQUEST               (UNICOMMI2CT_SR_TREQ_MASK)

/*!
 * @brief I2CT Receive Request
 *        I2CT 接收请求标志。
 */
#define DL_I2CT_STATUS_RECEIVE_REQUEST                (UNICOMMI2CT_SR_RREQ_MASK)

/*!
 * @brief I2CT ACK override enabled
 *        I2CT ACK 覆盖使能标志。
 */
#define DL_I2CT_STATUS_ACK_OVERRIDE_ENABLED         (UNICOMMI2CT_SR_ACKOEN_MASK)

/** @}*/

/** @addtogroup DL_I2CT_INTERRUPT
 *  @{
 */
/*!
 * @brief Receive Data Interrupt (byte has been received)
 *        接收数据完成中断。
 */
#define DL_I2CT_INTERRUPT_RX_DONE      (UNICOMMI2CT_CPU_INT_IMASK_RXDONE_SET)

/*!
 * @brief Transmit Transaction completed Interrupt
 *        发送事务完成中断。
 */
#define DL_I2CT_INTERRUPT_TX_DONE      (UNICOMMI2CT_CPU_INT_IMASK_TXDONE_SET)

/*!
 * @brief Receive FIFO Trigger
 *        RX FIFO 触发中断。
 */
#define DL_I2CT_INTERRUPT_RXFIFO_TRIGGER                                \
                                          (UNICOMMI2CT_CPU_INT_IMASK_RXTRG_SET)

/*!
 * @brief Transmit FIFO Trigger
 *        TX FIFO 触发中断。
 */
#define DL_I2CT_INTERRUPT_TXFIFO_TRIGGER                                \
                                          (UNICOMMI2CT_CPU_INT_IMASK_TXTRG_SET)

/*!
 * @brief RX FIFO full
 *        RX FIFO 满中断。
 */
#define DL_I2CT_INTERRUPT_RXFIFO_FULL                                   \
                                         (UNICOMMI2CT_CPU_INT_IMASK_RXFULL_SET)

/*!
 * @brief TX FIFO empty. All data in Transmit FIFO shifted out and
 * transmit goes into idle mode.
 *        TX FIFO 空中断。
 */
#define DL_I2CT_INTERRUPT_TXFIFO_EMPTY                                  \
                                            (UNICOMMI2CT_CPU_INT_IMASK_TXEMPTY_SET)

/*!
 * @brief Start Condition detected
 *        START 条件检测中断。
 */
#define DL_I2CT_INTERRUPT_START                                         \
                                              (UNICOMMI2CT_CPU_INT_IMASK_START_SET)

/*!
 * @brief Stop Condition detected
 *        STOP 条件检测中断。
 */
#define DL_I2CT_INTERRUPT_STOP           (UNICOMMI2CT_CPU_INT_IMASK_STOP_SET)

/*!
 * @brief General Call Interrupt
 *        广播呼叫中断。
 */
#define DL_I2CT_INTERRUPT_GENERAL_CALL                                  \
                                            (UNICOMMI2CT_CPU_INT_IMASK_GENCALL_SET)

/*!
 * @brief DMA Done on Event 1 Publisher
 *        事件 1 DMA 完成中断（发送方向）。
 */
#define DL_I2CT_INTERRUPT_EVENT1_DMA_DONE                               \
                                        (UNICOMMI2CT_CPU_INT_IMASK_DMA_DONE_TX_SET)

/*!
 * @brief DMA Done on Event 2 Publisher
 *        事件 2 DMA 完成中断（接收方向）。
 */
#define DL_I2CT_INTERRUPT_EVENT2_DMA_DONE                               \
                                        (UNICOMMI2CT_CPU_INT_IMASK_DMA_DONE_RX_SET)


/*!
 * @brief SMBus/PMBus PEC Receive Error Interrupt
 *        PEC 接收错误中断。
 */
#define DL_I2CT_INTERRUPT_PEC_RX_ERROR                                  \
                                         (UNICOMMI2CT_CPU_INT_IMASK_PEC_RX_ERR_SET)

/*!
 * @brief TX FIFO Underflow Interrupt
 *        TX FIFO 下溢中断。
 */
#define DL_I2CT_INTERRUPT_TXFIFO_UNDERFLOW                              \
                                            (UNICOMMI2CT_CPU_INT_IMASK_TX_UNFL_SET)

/*!
 * @brief RX FIFO Overflow Interrupt
 *        RX FIFO 上溢中断。
 */
#define DL_I2CT_INTERRUPT_RXFIFO_OVERFLOW                              \
                                            (UNICOMMI2CT_CPU_INT_IMASK_RX_OVFL_SET)

/*!
 * @brief Arbitration Lost Interrupt
 *        仲裁丢失中断。
 */
#define DL_I2CT_INTERRUPT_ARBITRATION_LOST                              \
                                            (UNICOMMI2CT_CPU_INT_IMASK_ARBLOST_SET)

/*!
 * @brief Interrupt Overflow Interrupt. Occurs when START or STOP
 *        interrupts overflow (i.e. occurs twice without being serviced)
 *        中断溢出中断（START/STOP 中断未及时处理）。
 */
#define DL_I2CT_INTERRUPT_OVERFLOW   (UNICOMMI2CT_CPU_INT_IMASK_RX_OVFL_SET)

/*!
 * @brief Timeout A Interrupt
 *        超时 A 中断。
 */
#define DL_I2CT_INTERRUPT_TIMEOUT_A          (UNICOMMI2CT_CPU_INT_IMASK_TIMEOUTA_SET)

/*!
 * @brief Timeout B Interrupt
 *        超时 B 中断。
 */
#define DL_I2CT_INTERRUPT_TIMEOUT_B          (UNICOMMI2CT_CPU_INT_IMASK_TIMEOUTB_SET)


/** @}*/

/** @addtogroup DL_I2CT_DMA_INTERRUPT
 *  @{
 */
/*!
 * @brief Peripheral Transmit FIFO Trigger interrupt for DMA trigger
 *        TX FIFO 触发 DMA 中断。
 */
#define DL_I2CT_DMA_INTERRUPT_TXFIFO_TRIGGER                            \
                                          (UNICOMMI2CT_DMA_TRIG0_IMASK_TXTRG_SET)

/*!
 * @brief Peripheral Receive FIFO Trigger interrupt for DMA trigger
 *        RX FIFO 触发 DMA 中断。
 */
#define DL_I2CT_DMA_INTERRUPT_RXFIFO_TRIGGER                            \
                                          (UNICOMMI2CT_DMA_TRIG1_IMASK_RXTRG_SET)

/** @}*/

    /* clang-format on */

