zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommi2ct.h
    /** @enum DL_I2CT_EVENT_ROUTE I2CT 事件路由选择 */
    typedef enum
    {
        /*! I2CT event route 1 事件路由 1 */
        DL_I2CT_EVENT_ROUTE_1 = 0,
        /*! I2CT event route 2 事件路由 2 */
        DL_I2CT_EVENT_ROUTE_2 = 12
    } DL_I2CT_EVENT_ROUTE;

    /** @enum DL_I2CT_CLOCK I2CT 时钟源选择 */
    typedef enum
    {
        /*!  BUSCLK enabled as I2CT clock source 总线时钟 */
        DL_I2CT_CLOCK_BUSCLK = UNICOMMI2CT_CLKSEL_BUSCLK_SEL_ENABLE,
        /*!  MFCLK enabled as I2CT clock source 主功能时钟 */
        DL_I2CT_CLOCK_MFCLK = UNICOMMI2CT_CLKSEL_MFCLK_SEL_ENABLE,
        /*!  Asynchronous SYSCLK enabled as I2CT clock source 异步系统时钟 */
        DL_I2CT_CLOCK_ASYNC_SYSCLK = UNICOMMI2CT_CLKSEL_ASYNC_SYSCLK_SEL_ENABLE,
        /*!  Asynchronous HFCLK enabled as I2CT clock source 异步高频时钟 */
        DL_I2CT_CLOCK_ASYNC_HFCLK = UNICOMMI2CT_CLKSEL_ASYNC_HFCLK_SEL_ENABLE,
        /*!  Asynchronous PLL enabled as I2CT clock source 异步 PLL 时钟 */
        DL_I2CT_CLOCK_ASYNC_PLL = UNICOMMI2CT_CLKSEL_ASYNC_PLL_SEL_ENABLE,
    } DL_I2CT_CLOCK;

    /** @enum DL_I2CT_CLOCK_DIVIDE I2CT 时钟分频系数 */
    typedef enum
    {
        /*!  I2CT Clock Divided by 1 */
        DL_I2CT_CLOCK_DIVIDE_1 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_1,
        /*!  I2CT Clock Divided by 2 */
        DL_I2CT_CLOCK_DIVIDE_2 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_2,
        /*!  I2CT Clock Divided by 3 */
        DL_I2CT_CLOCK_DIVIDE_3 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_3,
        /*!  I2CT Clock Divided by 4 */
        DL_I2CT_CLOCK_DIVIDE_4 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_4,
        /*!  I2CT Clock Divided by 5 */
        DL_I2CT_CLOCK_DIVIDE_5 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_5,
        /*!  I2CT Clock Divided by 6 */
        DL_I2CT_CLOCK_DIVIDE_6 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_6,
        /*!  I2CT Clock Divided by 7 */
        DL_I2CT_CLOCK_DIVIDE_7 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_7,
        /*!  I2CT Clock Divided by 8 */
        DL_I2CT_CLOCK_DIVIDE_8 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_8,
    } DL_I2CT_CLOCK_DIVIDE;

    /** @enum DL_I2CT_ADDRESSING_MODE I2CT 寻址模式 */
    typedef enum
    {
        /*! Enable in 7-bit addressing mode 7 位地址模式 */
        DL_I2CT_ADDRESSING_MODE_7_BIT = UNICOMMI2CT_OAR_MODE_MODE7,
        /*! Enable in 10-bit addressing mode 10 位地址模式 */
        DL_I2CT_ADDRESSING_MODE_10_BIT = UNICOMMI2CT_OAR_MODE_MODE10,
    } DL_I2CT_ADDRESSING_MODE;

    /** @enum DL_I2CT_PEC_STATUS I2CT PEC 校验状态 */
    typedef enum
    {
        /*!  I2CT SMBus/PMBus PEC was checked in the transaction that occurred
         *   before the last Stop 上次事务已进行 PEC 校验 */
        DL_I2CT_PEC_STATUS_CHECKED = UNICOMMI2CT_PECSR_PECSTS_CHECK_SET,
        /*!  I2CT SMBus/PMBus PEC was not checked in the transaction that
         *   occurred before the last Stop 上次事务未进行 PEC 校验 */
        DL_I2CT_PEC_STATUS_NOT_CHECKED = UNICOMMI2CT_PECSR_PECSTS_CHECK_CLEARED,
    } DL_I2CT_PEC_STATUS;

    /** @enum DL_I2CT_PEC_CHECK_ERROR I2CT PEC 校验错误状态 */
    typedef enum
    {
        /*!  Indicates PEC check error did not occurr in the transaction that
         *   occurred before the last Stop 上次事务 PEC 校验无误 */
        DL_I2CT_PEC_CHECK_ERROR_CLEARED = UNICOMMI2CT_PECSR_PECSTS_ERROR_CLEARED,
        /*!  Indicates PEC check error occurred in the transaction that
         *   occurred before the last Stop 上次事务 PEC 校验出错 */
        DL_I2CT_PEC_CHECK_ERROR_SET = UNICOMMI2CT_PECSR_PECSTS_ERROR_SET,
    } DL_I2CT_PEC_CHECK_ERROR;

    /** @enum DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH I2CT 数字毛刺滤波宽度 */
    typedef enum
    {
        /*!  Pulses filtering disabled. 禁用毛刺滤波 */
        DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_DISABLED =
            UNICOMMI2CT_GFCTL_DGFSEL_DISABLED,
        /*!  Pulses shorter than 1 functional clock tick in length are filtered.  */
        DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_1 =
            UNICOMMI2CT_GFCTL_DGFSEL_CLK_1,
        /*!  Pulses shorter than 2 functional clock ticks in length are filtered.  */
        DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_2 =
            UNICOMMI2CT_GFCTL_DGFSEL_CLK_2,
        /*!  Pulses shorter than 3 functional clock ticks in length are filtered.  */
        DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_3 =
            UNICOMMI2CT_GFCTL_DGFSEL_CLK_3,
        /*!  Pulses shorter than 4 functional clock ticks in length are filtered.  */
        DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_4 =
            UNICOMMI2CT_GFCTL_DGFSEL_CLK_4,
        /*!  Pulses shorter than 8 functional clock ticks in length are filtered.  */
        DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_8 =
            UNICOMMI2CT_GFCTL_DGFSEL_CLK_8,
        /*!  Pulses shorter than 16 functional clock ticks in length are filtered.  */
        DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_16 =
            UNICOMMI2CT_GFCTL_DGFSEL_CLK_16,
        /*!  Pulses shorter than 31 functional clock ticks in length are filtered.  */
        DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_31 =
            UNICOMMI2CT_GFCTL_DGFSEL_CLK_31,
    } DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH;

    /** @enum DL_I2CT_TX_FIFO_LEVEL I2CT TX FIFO 中断触发阈值 */
    typedef enum
    {
        /*! Interrupt triggers when FIFO <= 3/4 empty */
        DL_I2CT_TX_FIFO_LEVEL_3_4_EMPTY = UNICOMMI2CT_IFLS_TXIFLSEL_LVL_3_4,
        /*! Interrupt triggers when FIFO <= 1/2 empty */
        DL_I2CT_TX_FIFO_LEVEL_1_2_EMPTY = UNICOMMI2CT_IFLS_TXIFLSEL_LVL_1_2,
        /*! Interrupt triggers when FIFO <= 1/4 empty */
        DL_I2CT_TX_FIFO_LEVEL_1_4_EMPTY = UNICOMMI2CT_IFLS_TXIFLSEL_LVL_1_4,
        /*! Interrupt triggers when FIFO is not full */
        DL_I2CT_TX_FIFO_LEVEL_ONE_ENTRY = UNICOMMI2CT_IFLS_TXIFLSEL_LVL_NOT_FULL,
        /*! Interrupt triggers when FIFO is empty */
        DL_I2CT_TX_FIFO_LEVEL_EMPTY = UNICOMMI2CT_IFLS_TXIFLSEL_LVL_EMPTY,
        /*! Interrupt triggers when FIFO is almost empty (FIFO <= 1) */
        DL_I2CT_TX_FIFO_LEVEL_ALMOST_EMPTY =
            UNICOMMI2CT_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY,
        /*! Interrupt triggers when FIFO is almost full (FIFO >= (MAX_FIFO_LEN - 1)) */
        DL_I2CT_TX_FIFO_LEVEL_ALMOST_FULL =
            UNICOMMI2CT_IFLS_TXIFLSEL_LVL_ALMOST_FULL
    } DL_I2CT_TX_FIFO_LEVEL;

    /** @enum DL_I2CT_RX_FIFO_LEVEL I2CT RX FIFO 中断触发阈值 */
    typedef enum
    {
        /*! Interrupt triggers when FIFO >= 3/4 full */
        DL_I2CT_RX_FIFO_LEVEL_3_4_FULL = UNICOMMI2CT_IFLS_RXIFLSEL_LVL_3_4,
        /*! Interrupt triggers when FIFO >= 1/2 full */
        DL_I2CT_RX_FIFO_LEVEL_1_2_FULL = UNICOMMI2CT_IFLS_RXIFLSEL_LVL_1_2,
        /*! Interrupt triggers when FIFO >= 1/4 full */
        DL_I2CT_RX_FIFO_LEVEL_1_4_FULL = UNICOMMI2CT_IFLS_RXIFLSEL_LVL_1_4,
        /*! Interrupt triggers when FIFO is not empty */
        DL_I2CT_RX_FIFO_LEVEL_ONE_ENTRY = UNICOMMI2CT_IFLS_RXIFLSEL_LVL_NOT_EMPTY,
        /*! Interrupt triggers when FIFO is full */
        DL_I2CT_RX_FIFO_LEVEL_FULL = UNICOMMI2CT_IFLS_RXIFLSEL_LVL_FULL,
        /*! Interrupt triggers when FIFO is almost full (FIFO >= (MAX_FIFO_LEN - 1)) */
        DL_I2CT_RX_FIFO_LEVEL_ALMOST_FULL =
            UNICOMMI2CT_IFLS_RXIFLSEL_LVL_ALMOST_FULL,
        /*! Interrupt triggers when FIFO is almost empty (FIFO <= 1) */
        DL_I2CT_RX_FIFO_LEVEL_ALMOST_EMPTY =
            UNICOMMI2CT_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY
    } DL_I2CT_RX_FIFO_LEVEL;

    /** @enum DL_I2CT_RESPONSE_OVERRIDE_VALUE I2CT 应答覆盖值 */
    typedef enum
    {
        /*!  manual ACK for valid data or command. 手动 ACK */
        DL_I2CT_RESPONSE_OVERRIDE_VALUE_ACK = UNICOMMI2CT_ACKCTL_ACKOVAL_DISABLE,
        /*!  manual NACK for invalid data or command. 手动 NACK */
        DL_I2CT_RESPONSE_OVERRIDE_VALUE_NACK = UNICOMMI2CT_ACKCTL_ACKOVAL_ENABLE,
    } DL_I2CT_RESPONSE_OVERRIDE_VALUE;

    /*! @enum DL_I2CT_IIDX I2CT 中断索引 */
    typedef enum
    {
        /*! Interrupt index for I2CT if no interrupt is pending 无中断 */
        DL_I2CT_IIDX_NO_INT = UNICOMMI2CT_IIDX_STAT_NO_INTR,
        /*! Interrupt index for I2CT Timeout A Event 超时 A */
        DL_I2CT_IIDX_TIMEOUT_A = UNICOMMI2CT_IIDX_STAT_TIMEOUTA,
        /*! Interrupt index for I2CT Timeout B Event 超时 B */
        DL_I2CT_IIDX_TIMEOUT_B = UNICOMMI2CT_IIDX_STAT_TIMEOUTB,

        /*! Interrupt index for I2CT Receive Data 接收完成 */
        DL_I2CT_IIDX_RX_DONE = UNICOMMI2CT_IIDX_STAT_RXDONEFG,
        /*! Interrupt index for I2CT Transmit Transaction completed 发送完成 */
        DL_I2CT_IIDX_TX_DONE = UNICOMMI2CT_IIDX_STAT_TXDONEFG,
        /*! Interrupt index for I2CT Receive FIFO Trigger RX FIFO 触发 */
        DL_I2CT_IIDX_RXFIFO_TRIGGER = UNICOMMI2CT_IIDX_STAT_RXTRG,
        /*! Interrupt index for I2CT Transmit FIFO Trigger TX FIFO 触发 */
        DL_I2CT_IIDX_TXFIFO_TRIGGER = UNICOMMI2CT_IIDX_STAT_TXTRG,
        /*! Interrupt index for I2CT RX FIFO full RX FIFO 满 */
        DL_I2CT_IIDX_RXFIFO_FULL = UNICOMMI2CT_IIDX_STAT_RXFULL,
        /*! Interrupt index for I2CT TX FIFO empty.
         * All data in Transmit FIFO shifted out and transmit goes into idle mode.
         * TX FIFO 空 */
        DL_I2CT_IIDX_TXFIFO_EMPTY = UNICOMMI2CT_IIDX_STAT_TXEMPTY,
        /*! Interrupt index for I2CT Start Condition detected START 条件检测 */
        DL_I2CT_IIDX_START = UNICOMMI2CT_IIDX_STAT_STARTFG,
        /*! Interrupt index for I2CT Stop Condition detected STOP 条件检测 */
        DL_I2CT_IIDX_STOP = UNICOMMI2CT_IIDX_STAT_STOPFG,
        /*! Interrupt index for I2CT General Call 广播呼叫 */
        DL_I2CT_IIDX_GENERAL_CALL = UNICOMMI2CT_IIDX_STAT_GENCALL,
        /*! Interrupt index for I2CT Event 1 DMA Done 事件 1 DMA 完成 */
        DL_I2CT_IIDX_EVENT1_DMA_DONE = UNICOMMI2CT_IIDX_STAT_DMA_DONE_TX,
        /*! Interrupt index for I2CT Event 2 DMA Done 事件 2 DMA 完成 */
        DL_I2CT_IIDX_EVENT2_DMA_DONE = UNICOMMI2CT_IIDX_STAT_DMA_DONE_RX,
        /*! Interrupt index for I2CT receive pre-emptive interrupt 发送预抢占中断 */
        DL_I2CT_IIDX_PREEMPT_INT_TX = UNICOMMI2CT_IIDX_STAT_DMA_PREIRQ_TX,
        /*! Interrupt index for I2CT receive pre-emptive interrupt 接收预抢占中断 */
        DL_I2CT_IIDX_PREEMPT_INT_RX = UNICOMMI2CT_IIDX_STAT_DMA_PREIRQ_RX,
        /*! Interrupt index for I2CT SMBus/PMBus PEC Receive Error Event PEC 接收错误 */
        DL_I2CT_IIDX_PEC_RX_ERROR = UNICOMMI2CT_IIDX_STAT_PEC_RX_ERR,
        /*! Interrupt index for I2CT TX FIFO underflow event TX FIFO 下溢 */
        DL_I2CT_IIDX_TXFIFO_UNDERFLOW = UNICOMMI2CT_IIDX_STAT_TX_UNFL,
        /*! Interrupt index for I2CT RX FIFO overflow event RX FIFO 上溢 */
        DL_I2CT_IIDX_RXFIFO_OVERFLOW = UNICOMMI2CT_IIDX_STAT_RX_OVFL,
        /*! Interrupt index for I2CT arbitration lost event 仲裁丢失 */
        DL_I2CT_IIDX_ARBITRATION_LOST = UNICOMMI2CT_IIDX_STAT_ARBLOSTFG,

