zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommi2ct.h
    } DL_I2CT_IIDX;

    /**
     * @brief  Configuration struct for @ref DL_I2CT_setClockConfig.
     *         I2CT 时钟配置结构体。
     */
    typedef struct
    {
        /*! I2CT module clock source. One of @ref DL_I2CT_CLOCK 时钟源选择 */
        DL_I2CT_CLOCK clockSel;
        /*! I2CT clock divider selection. One of @ref DL_I2CT_CLOCK_DIVIDE 时钟分频系数 */
        DL_I2CT_CLOCK_DIVIDE divideRatio;
    } DL_I2CT_ClockConfig;

    /**
     *  @brief      Configure I2CT source clock
     *  @details    功能：配置 UNICOMM I2CT 模式时钟源与分频参数。
     *
     *  @param[in]  unicomm    Pointer to the register overlay for the
     *                      peripheral
     *                      参数：UNICOMM 外设寄存器实例。
     *  @param[in]  config  Pointer to the clock configuration struct
     *                       @ref DL_I2CT_ClockConfig.
     *                       参数：时钟配置结构体指针。
     *
     *  @return     返回值：无。
     */
    void DL_I2CT_setClockConfig(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_ClockConfig *config);

    /**
     *  @brief      Get I2CT source clock configuration
     *  @details    功能：读取 UNICOMM I2CT 模式当前时钟配置。
     *
     *  @param[in]  unicomm    Pointer to the register overlay for the
     *                      peripheral
     *                      参数：UNICOMM 外设寄存器实例。
     *  @param[in]  config  Pointer to the clock configuration struct
     *                      @ref DL_I2CT_ClockConfig.
     *                      参数：用于回填配置的结构体指针。
     *
     *  @return     返回值：无。
     */
    void DL_I2CT_getClockConfig(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_ClockConfig *config);

    /**
     *  @brief      Checks if TX FIFO is full
     *              检查 TX FIFO 是否已满。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If TX FIFO is full
     *              返回值：TX FIFO 是否已满。
     *
     *  @retval     true if TX FIFO is full
     *  @retval     false if TX FIFO is not full
     */
    __STATIC_INLINE bool DL_I2CT_isTXFIFOFull(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->SR & UNICOMMI2CT_SR_TXFF_MASK) ==
                UNICOMMI2CT_SR_TXFF_SET);
    }

    /**
     *  @brief      Checks if TX FIFO is empty
     *              检查 TX FIFO 是否为空。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If TX FIFO is empty
     *              返回值：TX FIFO 是否为空。
     *
     *  @retval     true if TX FIFO is empty
     *  @retval     false if TX FIFO is not empty
     */
    __STATIC_INLINE bool DL_I2CT_isTXFIFOEmpty(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->SR & UNICOMMI2CT_SR_TXFE_MASK) ==
                UNICOMMI2CT_SR_TXFE_SET);
    }

    /**
     *  @brief      Checks if RX FIFO is full
     *              检查 RX FIFO 是否已满。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If RX FIFO is full
     *              返回值：RX FIFO 是否已满。
     *
     *  @retval     true if RX FIFO is full
     *  @retval     false if RX FIFO is not full
     */
    __STATIC_INLINE bool DL_I2CT_isRXFIFOFull(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->SR & UNICOMMI2CT_SR_RXFF_MASK) ==
                UNICOMMI2CT_SR_RXFF_SET);
    }

    /**
     *  @brief      Checks if RX FIFO is empty
     *              检查 RX FIFO 是否为空。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If RX FIFO is empty
     *              返回值：RX FIFO 是否为空。
     *
     *  @retval     true if RX FIFO is empty
     *  @retval     false if RX FIFO is not empty
     */
    __STATIC_INLINE bool DL_I2CT_isRXFIFOEmpty(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->SR & UNICOMMI2CT_SR_RXFE_MASK) ==
                UNICOMMI2CT_SR_RXFE_SET);
    }

    /**
     *  @brief      Fills the TX FIFO with data
     *  @details    功能：批量写入 I2CT TX FIFO，直到 FIFO 满或达到上限。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  buffer  Pointer to buffer of bytes
     *                      参数：发送缓冲区。
     *  @param[in]  count   Number of bytes to fill TX FIFO from buffer
     *                      参数：最大写入字节数。
     *
     *  @return     Number of bytes that were successfully written
     *              返回值：实际写入字节数。
     */
    uint8_t DL_I2CT_fillTXFIFO(
        UNICOMM_Inst_Regs *unicomm, uint8_t *buffer, uint8_t count);

    /**
     *  @brief      Flushes/removes all elements in the TX FIFO
     *  @details    功能：清空 I2CT TX FIFO 并等待硬件完成。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     返回值：无。
     */
    void DL_I2CT_flushTXFIFO(UNICOMM_Inst_Regs *unicomm);

    /**
     *  @brief      Flushes/removes all elements in the RX FIFO
     *  @details    功能：清空 I2CT RX FIFO 并等待硬件完成。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     返回值：无。
     */
    void DL_I2CT_flushRXFIFO(UNICOMM_Inst_Regs *unicomm);

    /**
     *  @brief      Stop TX FIFO flush
     *              停止 TX FIFO 刷新。
     *
     *  Before stopping the flush, check if @ref DL_I2CT_isTXFIFOEmpty,
     *  indicating flush is complete.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_stopFlushTXFIFO(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->IFLS &= ~(UNICOMMI2CT_IFLS_TXCLR_MASK);
    }

    /**
     *  @brief      Start TX FIFO flush
     *              启动 TX FIFO 刷新。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_startFlushTXFIFO(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->IFLS |= UNICOMMI2CT_IFLS_TXCLR_MASK;
    }

    /**
     *  @brief      Stop RX FIFO flush
     *              停止 RX FIFO 刷新。
     *
     *  Before stopping the flush, check if @ref DL_I2CT_isRXFIFOEmpty,
     *  indicating flush is complete.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_stopFlushRXFIFO(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->IFLS &= ~(UNICOMMI2CT_IFLS_RXCLR_MASK);
    }

    /**
     *  @brief      Start RX FIFO flush
     *              启动 RX FIFO 刷新。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_startFlushRXFIFO(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->IFLS |= UNICOMMI2CT_IFLS_RXCLR_MASK;
    }

    /**
     *  @brief  Transmit data, waiting until transmit request
     *  @details 功能：阻塞等待发送请求后发送 1 字节，并等待总线空闲。
     *
     *  @note   Setting own addresses and enabling should be done
     *  separately.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  data    Byte of data to transmit
     *                      参数：待发送字节。
     *
     *  @return     返回值：无。
     */
    void DL_I2CT_transmitDataBlocking(UNICOMM_Inst_Regs *unicomm, uint8_t data);

    /**
     *  @brief  Transmit data
     *  @details 功能：尝试发送 1 字节，若 TX FIFO 满则返回失败。
     *
     *  @note   Setting own addresses and enabling should be done
     *  separately.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  data    Byte of data to transmit
     *                      参数：待发送字节。
     *
     *  @return Whether data could be transmitted or not
     *  @retval true if data could be transmitted
     *  @retval false if data could not be transmitted
     *          返回值：`true` 发送成功，`false` 表示 FIFO 满。
     */
    bool DL_I2CT_transmitDataCheck(UNICOMM_Inst_Regs *unicomm, uint8_t data);

    /**
     *  @brief  Receive data, waiting until receive request
     *  @details 功能：阻塞等待接收请求后读取 1 字节数据。
     *
     *  @note   Setting own addresses and enabling should be done
     *  separately.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return Data received from
     *          返回值：接收到的字节数据。
     */
    uint8_t DL_I2CT_receiveDataBlocking(UNICOMM_Inst_Regs *unicomm);

    /**
     *  @brief  Receive data
     *  @details 功能：尝试读取 1 字节，若 RX FIFO 空则返回失败。
     *
     *  @note   Setting own addresses and enabling should be done
     *  separately.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  buffer  Pointer to where byte of received data should be stored
     *                      参数：接收输出指针。
     *
     *  @return Whether data could be received or not
     *  @retval true if data could be received
     *  @retval false if data could not be received
     *          返回值：`true` 读取成功，`false` 表示 FIFO 空。
     */
    bool DL_I2CT_receiveDataCheck(UNICOMM_Inst_Regs *unicomm, uint8_t *buffer);

    /**
     * @brief Enables power on UNICOMM I2C module
     *        使能 UNICOMM I2C 模块电源。
     *
     * @param[in] unicomm        Pointer to the register overlay for the peripheral
     *                           参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enablePower(UNICOMM_Inst_Regs *unicomm)
    {
        DL_UNICOMM_enablePower(unicomm);
        if (unicomm->fixedMode == false)
        {
            DL_UNICOMM_setIPMode(unicomm, DL_UNICOMM_I2C_TARGET);
        }
    }

    /**
     * @brief Disables power on UNICOMM I2C module
     *        关闭 UNICOMM I2C 模块电源。
     *
     * @param[in] unicomm        Pointer to the register overlay for the peripheral
     *                           参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disablePower(UNICOMM_Inst_Regs *unicomm)
    {
        DL_UNICOMM_disablePower(unicomm);
    }

    /**
     * @brief Returns if  power on UNICOMM I2C module
     *        查询 UNICOMM I2C 模块电源是否已使能。
     *
     * @param[in] unicomm        Pointer to the register overlay for the peripheral
     *                           参数：UNICOMM 外设寄存器实例。
     *
     * @return true if power is enabled
     * @return false if power is disabled
     *         返回值：`true` 已使能，`false` 已关闭。
     */
    __STATIC_INLINE bool DL_I2CT_isPowerEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return DL_UNICOMM_isPowerEnabled(unicomm);
    }

    /**
     * @brief Resets UNICOMM I2C peripheral
     *        复位 UNICOMM I2C 外设。
     *
     * @param[in] unicomm        Pointer to the register overlay for the peripheral
     *                           参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_reset(UNICOMM_Inst_Regs *unicomm)
    {
        DL_UNICOMM_reset(unicomm);
    }

    /**
     * @brief Returns if UNICOMM I2C peripheral was reset
     *        查询 UNICOMM I2C 外设是否已完成复位。
     *
     * @param[in] unicomm        Pointer to the register overlay for the peripheral
     *                           参数：UNICOMM 外设寄存器实例。
     *
     * @return true if peripheral was reset
     * @return false if peripheral wasn't reset
     *         返回值：`true` 已复位，`false` 未复位。
     */
    __STATIC_INLINE bool DL_I2CT_isReset(UNICOMM_Inst_Regs *unicomm)
    {
        return DL_UNICOMM_isReset(unicomm);
    }

    /**
     * @brief Set Clock Source
     *        设置 I2CT 时钟源。
     *
     *  Clock sources depend on device and clock should be enabled
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                             参数：UNICOMM 外设寄存器实例。
     *  @param[in]  clockSource    One of @ref DL_I2CT_CLOCK.
     *                             参数：时钟源选择。
     *
     */
    __STATIC_INLINE void DL_I2CT_selectClockSource(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_CLOCK clockSource)
    {
        DL_Common_updateReg(&unicomm->i2ct->CLKSEL, (uint32_t)clockSource,
                            UNICOMMI2CT_CLKSEL_BUSCLK_SEL_MASK |
                                UNICOMMI2CT_CLKSEL_MFCLK_SEL_MASK);
    }

    /**
     * @brief Set Clock Divider
     *        设置 I2CT 时钟分频系数。
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                             参数：UNICOMM 外设寄存器实例。
     *  @param[in]  clockDivider   One of @ref DL_I2CT_CLOCK_DIVIDE.
     *                             参数：时钟分频系数。
     *
     */
    __STATIC_INLINE void DL_I2CT_selectClockDivider(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_CLOCK_DIVIDE clockDivider)
    {
        DL_Common_updateReg(&unicomm->i2ct->CLKDIV, (uint32_t)clockDivider,
                            UNICOMMI2CT_CLKDIV_RATIO_MASK);
    }

    /**
     *  @brief      Get Digital Glitch Suppression Pulse Width
     *              获取 SCL/SDA 数字毛刺滤波宽度。
     *
     *  Pulse width for the digital glitch suppression on SCL/SDA lines.
     *  Values are in terms of functional clock ticks.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Digital glitch suppression pulse width
     *              返回值：数字毛刺滤波宽度枚举值。
     *
     *  @retval     One of @ref DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH.
     */
    __STATIC_INLINE DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH
    DL_I2CT_getDigitalGlitchFilterPulseWidth(UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t filterWidth =
            unicomm->i2ct->GFCTL & UNICOMMI2CT_GFCTL_DGFSEL_MASK;

        return (DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH)(filterWidth);
    }

    /**
     *  @brief      Set Digital Glitch Suppression Pulse Width
     *              设置 SCL/SDA 数字毛刺滤波宽度。
     *
     *  Pulse width for the digital glitch suppression on SCL/SDA lines.
     *  Values are in terms of functional clock ticks.
     *
     *  @param[in]  unicomm             Pointer to the register overlay for the
     *                              peripheral
     *                              参数：UNICOMM 外设寄存器实例。
     *  @param[in]  filterWidth     One of @ref DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH.
     *                              参数：滤波宽度枚举值。
     */
    __STATIC_INLINE void DL_I2CT_setDigitalGlitchFilterPulseWidth(
        UNICOMM_Inst_Regs *unicomm,
        DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH filterWidth)
    {
        DL_Common_updateReg(&unicomm->i2ct->GFCTL, (uint32_t)filterWidth,
                            UNICOMMI2CT_GFCTL_DGFSEL_MASK);
    }

    /**
     *  @brief      Disable Analog Glitch Suppression
     *              禁用 SCL/SDA 模拟毛刺抑制。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableAnalogGlitchFilter(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->GFCTL &= ~(UNICOMMI2CT_GFCTL_AGFEN_MASK);
    }

    /**
     *  @brief      Checks if analog glitch suppression is enabled
     *              检查模拟毛刺抑制是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If analog glitch suppression is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if analog glitch suppression is enabled
     *  @retval     false if analog glitch suppression is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isAnalogGlitchFilterEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->GFCTL & UNICOMMI2CT_GFCTL_AGFEN_MASK) ==
                UNICOMMI2CT_GFCTL_AGFEN_ENABLE);
    }

    /**
     *  @brief      Enable Analog Glitch Suppression
     *              使能 SCL/SDA 模拟毛刺抑制。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enableAnalogGlitchFilter(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->GFCTL |= UNICOMMI2CT_GFCTL_AGFEN_ENABLE;
    }

    /**
     *  @brief      Set own address
     *              设置自身从机地址。
     *
     * This field specifies bits A9 through A0 of the own address.
     *
     * In 7-bit addressing mode as selected by @ref DL_I2CT_setAddressingMode,
     * the top 3 bits are don't care
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  addr    Value of own address [0x00, 0x3FF]
     *                      参数：自身地址值。
     */
    __STATIC_INLINE void DL_I2CT_setOwnAddress(
        UNICOMM_Inst_Regs *unicomm, uint32_t addr)
    {
        DL_Common_updateReg(&unicomm->i2ct->OAR, addr, UNICOMMI2CT_OAR_OAR_MASK);
    }

    /**
     *  @brief      Get own address
     *              获取自身从机地址。
     *
     * Get bits A9 through A0 of the own address.
     *
     * In 7-bit addressing mode as selected by @ref DL_I2CT_setAddressingMode,
     * the top 3 bits are don't care
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @return     own address
     *              返回值：自身地址值。
     *
     *  @retval     [0x00, 0x3FF]
     */
    __STATIC_INLINE uint32_t DL_I2CT_getOwnAddress(UNICOMM_Inst_Regs *unicomm)
    {
        return (unicomm->i2ct->OAR & UNICOMMI2CT_OAR_OAR_MASK);
    }

    /**
     *  @brief      Enable own address
     *              使能自身地址匹配。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @sa DL_I2CT_setOwnAddress
     */
    __STATIC_INLINE void DL_I2CT_enableOwnAddress(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->OAR |= UNICOMMI2CT_OAR_OAREN_ENABLE;
    }

    /**
     *  @brief      Disable own address
     *              禁用自身地址匹配。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableOwnAddress(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->OAR &= ~(UNICOMMI2CT_OAR_OAR_MASK);
    }

    /**
     *  @brief      Checks if own address is enabled
     *              检查自身地址匹配是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If own address is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if own address is enabled
     *  @retval     false if own address is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isOwnAddressEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->OAR & UNICOMMI2CT_OAR_OAREN_MASK) ==
                UNICOMMI2CT_OAR_OAREN_ENABLE);
    }

    /**
     *  @brief      Set addressing mode
     *              设置寻址模式（7 位或 10 位）。
     *
     *  Selects the addressing mode to be used when device is configured as a
     *
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  mode    Addressing mode to set the to.
     *                      One of @ref DL_I2CT_ADDRESSING_MODE.
     *                      参数：寻址模式枚举值。
     */
    __STATIC_INLINE void DL_I2CT_setAddressingMode(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_ADDRESSING_MODE mode)
    {
        DL_Common_updateReg(
            &unicomm->i2ct->OAR, (uint32_t)mode, UNICOMMI2CT_OAR_MODE_MASK);
    }

    /**
     *  @brief      Get addressing mode
     *              获取当前寻址模式。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Addressing mode the is set to
     *              返回值：寻址模式枚举值。
     *
     *  @retval     One of @ref DL_I2CT_ADDRESSING_MODE
     */
    __STATIC_INLINE DL_I2CT_ADDRESSING_MODE DL_I2CT_getAddressingMode(
        UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t mode = unicomm->i2ct->OAR & UNICOMMI2CT_OAR_MODE_MASK;

