zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommi2ct.h
        return (DL_I2CT_ADDRESSING_MODE)(mode);
    }

    /**
     *  @brief      Get own address alternate
     *              获取备用自身地址。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @return     own address alternate
     *              返回值：备用地址。
     *
     *  @retval     [0x00, 0x7f]
     */
    __STATIC_INLINE uint32_t UNICOMMI2CT_getOwnAddressAlternate(
        UNICOMM_Inst_Regs *unicomm)
    {
        return (unicomm->i2ct->OAR2 & UNICOMMI2CT_OAR2_OAR2_MASK);
    }

    /**
     *  @brief      Set own address alternate
     *              设置备用自身地址。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  addr    Value of own address alternate [0x00, 0x7f]
     *                      参数：备用地址值。
     */
    __STATIC_INLINE void DL_I2CT_setOwnAddressAlternate(
        UNICOMM_Inst_Regs *unicomm, uint32_t addr)
    {
        DL_Common_updateReg(
            &unicomm->i2ct->OAR2, addr, UNICOMMI2CT_OAR2_OAR2_MASK);
    }

    /**
     *  @brief      Get own address alternate mask
     *              获取备用地址掩码。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Which bits of the address are matched
     *              返回值：地址匹配掩码。
     *
     *  @retval     Bit mask with each bit corresponding to bits A6 through A0 of
     *              the address. Value between [0x00, 0x7F]
     */
    __STATIC_INLINE uint32_t DL_I2CT_getOwnAddressAlternateMask(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->OAR2 & UNICOMMI2CT_OAR2_OAR2_MASK_MASK) >>
                UNICOMMI2CT_OAR2_OAR2_MASK_OFS);
    }

    /**
     *  @brief      Set own address alternate mask
     *              设置备用地址掩码（值为 1 的位自动匹配）。
     *
     * This field specifies bits A6 through A0 of the address. The bits with
     * a value of 1 in the SOAR2.OAR2_MASK field will make the corresponding
     * incoming address bits to match by default regardless of the value inside
     * SOAR2.OAR2 i.e. corresponding SOAR2.OAR2 bit is a don't care.
     *
     *  @param[in]  unicomm           Pointer to the register overlay for the peripheral
     *                                参数：UNICOMM 外设寄存器实例。
     *  @param[in]  addressMask   Bit mask of address bits to match.
     *                            Value between [0x00, 0x7F]
     *                            参数：地址匹配掩码。
     */
    __STATIC_INLINE void DL_I2CT_setOwnAddressAlternateMask(
        UNICOMM_Inst_Regs *unicomm, uint32_t addressMask)
    {
        DL_Common_updateReg(&unicomm->i2ct->OAR2,
                            addressMask << UNICOMMI2CT_OAR2_OAR2_MASK_OFS,
                            UNICOMMI2CT_OAR2_OAR2_MASK_MASK);
    }

    /**
     *  @brief      Disable usage of own address alternate
     *              禁用备用自身地址。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableOwnAddressAlternate(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->OAR2 &= ~(UNICOMMI2CT_OAR2_OAR2EN_MASK);
    }

    /**
     *  @brief      Checks if own address alternate is enabled
     *              检查备用自身地址是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If own address alternate is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if own address alternate is enabled
     *  @retval     false if own address alternate is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isOwnAddressAlternateEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->OAR2 & UNICOMMI2CT_OAR2_OAR2EN_MASK) ==
                UNICOMMI2CT_OAR2_OAR2EN_ENABLE);
    }

    /**
     *  @brief      Enable usage of own address alternate
     *              使能备用自身地址。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enableOwnAddressAlternate(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->OAR2 |= UNICOMMI2CT_OAR2_OAR2EN_ENABLE;
    }

    /**
     *  @brief      Get the address for which address match happened
     *              获取地址匹配到的地址值。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Matched address
     *              返回值：匹配到的地址。
     *
     *  @retval     Bit mask with each bit corresponding to the address.
     *  Value between [0x00, 0x7F] in 7-bit mode, or [0x00, 0x3FF] in 10-bit mode.
     */
    __STATIC_INLINE uint32_t DL_I2CT_getAddressMatch(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->SR & UNICOMMI2CT_SR_ADDRMATCH_MASK) >>
                UNICOMMI2CT_SR_ADDRMATCH_OFS);
    }

    /**
     *  @brief      Disable clock stretching
     *              禁用时钟拉伸。
     *
     *  Clock stretching should be enabled to be compliant with I2CT specification
     *  and the SCL will be stretched when data must be read or written from the
     *  FIFO. It can optionally be disabled if a controller does not support it or
     *  to achieve maximum I2CT frequency; however the developer should ensure that
     *  the FIFO is written or read on time.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableClockStretching(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR &= ~(UNICOMMI2CT_CTR_CLKSTRETCH_MASK);
    }

    /**
     *  @brief      Checks if clock stretching is enabled
     *              检查时钟拉伸是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If clock stretching is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if clock stretching is enabled
     *  @retval     false if clock stretching is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isClockStretchingEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->CTR & UNICOMMI2CT_CTR_CLKSTRETCH_MASK) ==
                UNICOMMI2CT_CTR_CLKSTRETCH_ENABLE);
    }

    /**
     *  @brief      Enable clock stretching
     *              使能时钟拉伸（符合 I2C 规范）。
     *
     *  Clock stretching should be enabled to be compliant with I2CT specification
     *  and the SCL will be stretched when data must be read or written from the
     *  FIFO. It can optionally be disabled if a controller does not support it or
     *  to achieve maximum I2CT frequency; however the developer should ensure that
     *  the FIFO is written or read on time.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enableClockStretching(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR |= UNICOMMI2CT_CTR_CLKSTRETCH_ENABLE;
    }

    /**
     *  @brief      Disable TX empty interrupt on transmit request
     *              禁用发送请求时的 TX 空中断。
     *
     * When disabled, RIS.STXEMPTY will be set when only the TX FIFO is
     * empty. This allows the STXEMPTY interrupt to be used to indicate that the
     * I2CT bus is being clock stretched and that TX data is required.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @sa         DL_I2CT_isClockStretchEnabled
     */
    __STATIC_INLINE void DL_I2CT_disableTXEmptyOnTXRequest(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR &= ~(UNICOMMI2CT_CTR_TXEMPTY_ON_TREQ_MASK);
    }

    /**
     *  @brief      Checks if TX empty interrupt on transmit request is
     *              enabled
     *              检查发送请求时的 TX 空中断是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If TX empty interrupt on transmit request is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if TX empty interrupt on transmit request is enabled
     *  @retval     false if TX empty interrupt on transmit request disabled
     */
    __STATIC_INLINE bool DL_I2CT_isTXEmptyOnTXRequestEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->CTR & UNICOMMI2CT_CTR_TXEMPTY_ON_TREQ_MASK) ==
                UNICOMMI2CT_CTR_TXEMPTY_ON_TREQ_ENABLE);
    }

    /**
     *  @brief      Enable TX empty interrupt on transmit request
     *              使能发送请求时的 TX 空中断（用于检测时钟拉伸状态）。
     *
     *  When enabled, RIS.STXEMPTY will be set when the state machine is in
     *  the TX_WAIT state which occurs when the TX FIFO is empty AND the UNICOMMI2CT
     *  transaction is clock stretched waiting for the FIFO to receive data.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enableTXEmptyOnTXRequest(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR |= UNICOMMI2CT_CTR_TXEMPTY_ON_TREQ_ENABLE;
    }

    /**
     *  @brief      Disable TX trigger in TX mode
     *              禁用发送模式下的 TX FIFO 触发。
     *
     * When disabled, RIS.TXFIFOTRG will only be set when the TX FIFO is at
     * or above the trigger level.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableTXTriggerInTXMode(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR &= ~(UNICOMMI2CT_CTR_TXTRIG_TXMODE_MASK);
    }

    /**
     *  @brief      Checks if TX trigger in TX mode is enabled
     *              检查发送模式下的 TX FIFO 触发是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If TX trigger in TX mode is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if TX trigger in TX mode is enabled
     *  @retval     false if TX trigger in TX mode is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isTXTriggerInTXModeEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->CTR & UNICOMMI2CT_CTR_TXTRIG_TXMODE_MASK) ==
                UNICOMMI2CT_CTR_TXTRIG_TXMODE_ENABLE);
    }

    /**
     *  @brief      Enable TX trigger when is in TX mode
     *              使能发送模式下的 TX FIFO 触发（延迟 DMA 加载至事务开始）。
     *
     *  When enabled, RIS.TXFIFOTRG will be set when the TX FIFO has reached
     *  the trigger level AND the state machine is in the TXMODE as defined
     *  in the SSR register. When cleared RIS.TXFIFOTRG will be set when the
     *  TX FIFO is at or above the trigger level. This setting can be used to hold
     *  off the TX DMA until a transaction starts. This allows the DMA to be
     *  configured when the I2CT is idle but have it wait till the transaction
     *  starts to load the TX FIFO, so it can load from a memory buffer that
     *  might be changing over time.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @sa                 DL_I2CT_INTERRUPT_TXFIFO_TRIGGER
     */
    __STATIC_INLINE void DL_I2CT_enableTXTriggerInTXMode(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR |= UNICOMMI2CT_CTR_TXTRIG_TXMODE_ENABLE;
    }

    /**
     *  @brief      Disable TX transfer waits when stale data in TX FIFO
     *              禁用 TX FIFO 过期数据等待。
     *
     *  When disabled, the TX FIFO empty signal to the state machine
     *  indicates that the TX FIFO is empty.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableTXWaitWhenTXFIFOStale(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR &= ~(UNICOMMI2CT_CTR_TXWAIT_STALE_TXFIFO_MASK);
    }

    /**
     *  @brief      Checks if TX transfer waits when stale data in TX FIFO
     *              is enabled
     *              检查 TX FIFO 过期数据等待是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If TX transfer waits when stale data in TX FIFO is
     *              enabled
     *              返回值：是否已使能。
     *
     *  @retval     true   if TX transfer waits when stale data in TX FIFO
     *                     is enabled
     *  @retval     false  if TX transfer waits when stale data in TX FIFO
     *                     is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isTXWaitWhenTXFIFOStaleEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->CTR & UNICOMMI2CT_CTR_TXWAIT_STALE_TXFIFO_MASK) ==
                UNICOMMI2CT_CTR_TXWAIT_STALE_TXFIFO_ENABLE);
    }

    /**
     *  @brief      Enable TX transfer waits when stale data in TX FIFO
     *              使能 TX FIFO 过期数据等待。
     *
     *  When enabled, the TX FIFO empty signal to the state machine will
     *  indicate that the TX FIFO is empty or that the TX FIFO data is stale. The
     *  TX FIFO data is determined to be stale when there is data in the TX FIFO
     *  when the state machine leaves the TXMODE as defined in the SSR
     *  register. This can occur is a Stop or timeout occur when there are bytes
     *  left in the TX FIFO.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enableTXWaitWhenTXFIFOStale(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR |= UNICOMMI2CT_CTR_TXWAIT_STALE_TXFIFO_ENABLE;
    }

    /**
     *  @brief      Disable RX full interrupt on receive request
     *              禁用接收请求时的 RX 满中断。
     *
     *  When disabled, RIS.SRXFULL will be set when only the RX FIFO is
     *  full. This allows the SRXFULL interrupt to be used to indicate that the
     *  I2CT bus is being clock stretched and that the FW must either read the RX
     *  FIFO or ACK/NACK the current RX byte.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @sa         DL_I2CT_isClockStretchEnabled
     */
    __STATIC_INLINE void DL_I2CT_disableRXFullOnRXRequest(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR &= ~(UNICOMMI2CT_CTR_RXFULL_ON_RREQ_MASK);
    }

    /**
     *  @brief      Checks if RX full interrupt on receive request is enabled
     *              检查接收请求时的 RX 满中断是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If RX full interrupt on receive request enabled
     *              返回值：是否已使能。
     *
     *  @retval     true   if RX full interrupt on receive request enabled
     *  @retval     false  if RX full interrupt on receive request disabled
     */
    __STATIC_INLINE bool DL_I2CT_isRXFullOnRXRequestEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->CTR & UNICOMMI2CT_CTR_RXFULL_ON_RREQ_MASK) ==
                UNICOMMI2CT_CTR_RXFULL_ON_RREQ_ENABLE);
    }

    /**
     *  @brief      Enable RX full interrupt on receive request
     *              使能接收请求时的 RX 满中断（用于检测时钟拉伸状态）。
     *
     *  When enabled, RIS.SRXFULL will be set when the state machine is in
     *  the RX_WAIT or RX_ACK_WAIT states which occurs when the I2CT transaction is
     *  clock stretched because the RX FIFO is full or the ACKOEN has been set and
     *  the state machine is waiting for FW to ACK/NACK the current byte.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     */
    __STATIC_INLINE void DL_I2CT_enableRXFullOnRXRequest(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR |= UNICOMMI2CT_CTR_RXFULL_ON_RREQ_ENABLE;
    }

    /**
     *  @brief      Disable SMBus/PMBus default host address of 000 1000b
     *              禁用 SMBus/PMBus 默认主机地址匹配。
     *
     *  When disabled, the default host address is not matched.
     *  NOTE: The host address may still be matched if programmed as an own address.
     *    The I2CT module can still be addressed as a if enabled and own
     *  address match is enabled.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableDefaultHostAddress(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR &= ~(UNICOMMI2CT_CTR_EN_DEFHOSTADR_MASK);
    }

    /**
     *  @brief      Checks if SMBus/PMBus default host address of 000 1000b is
     *              enabled
     *              检查 SMBus/PMBus 默认主机地址匹配是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If default host address is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true   if default host address is enabled
     *  @retval     false  if default host address disabled
     */
    __STATIC_INLINE bool DL_I2CT_isDefaultHostAddressEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->CTR & UNICOMMI2CT_CTR_EN_DEFHOSTADR_MASK) ==
                UNICOMMI2CT_CTR_EN_DEFHOSTADR_ENABLE);
    }

    /**
     *  @brief      Enable SMBus/PMBus default host address of 000 1000b
     *              使能 SMBus/PMBus 默认主机地址匹配。
     *
     *  When enabled, default host address of 0x0001000 is always matched by the
     *  address match logic
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enableDefaultHostAddress(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR |= UNICOMMI2CT_CTR_EN_DEFHOSTADR_ENABLE;
    }

    /**
     *  @brief      Disable SMBus/PMBus Alert response address (ARA) of 000 1100b
     *              禁用 SMBus/PMBus 告警响应地址匹配。
     *
     *  When disabled, the alert response address 0x0001100 is not matched.
     *  NOTE: The alert response address may still be matched if programmed as an
     *  own address.
     *    The I2CT module can still be addressed as a if enabled and own
     *  address match is enabled.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableAlertResponseAddress(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR &= ~(UNICOMMI2CT_CTR_EN_ALRESPADR_MASK);
    }

    /**
     *  @brief      Checks if SMBus/PMBus Alert response address (ARA) of 000 1100b
     *              is enabled
     *              检查 SMBus/PMBus 告警响应地址匹配是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If alert response address is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true   if alert response address is enabled
     *  @retval     false  if alert response address disabled
     */
    __STATIC_INLINE bool DL_I2CT_isAlertResponseAddressEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->CTR & UNICOMMI2CT_CTR_EN_ALRESPADR_MASK) ==
                UNICOMMI2CT_CTR_EN_ALRESPADR_ENABLE);
    }

    /**
     *  @brief      Enable SMBus/PMBus Alert response address (ARA) of 000 1100b
     *              使能 SMBus/PMBus 告警响应地址匹配。
     *
     *  When enabled, default alert response address of 0x0001100 is always matched
     *  by the address match logic
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enableAlertResponseAddress(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR |= UNICOMMI2CT_CTR_EN_ALRESPADR_ENABLE;
    }

    /**
     *  @brief      Disable SMBus/PMBus default device address of 110 0001b
     *              禁用 SMBus/PMBus 默认设备地址匹配（地址解析协议）。
     *
     *  Used for Address Resolution Protocol. When disabled, the default device
     *  address is not matched.
     *  NOTE: The host address may still be matched if programmed as an own address.
     *    The I2CT module can still be addressed as a if enabled and own
     *  address match is enabled.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableDefaultDeviceAddress(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR &= ~(UNICOMMI2CT_CTR_EN_DEFDEVADR_MASK);
    }

    /**
     *  @brief      Checks SMBus/PMBus default device address of 110 0001b is
     *              enabled
     *              检查 SMBus/PMBus 默认设备地址匹配是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If default device address is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true   if default device address is enabled
     *  @retval     false  if default device address disabled
     */
    __STATIC_INLINE bool DL_I2CT_isDefaultDeviceAddressEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->CTR & UNICOMMI2CT_CTR_EN_DEFDEVADR_MASK) ==
                UNICOMMI2CT_CTR_EN_DEFDEVADR_ENABLE);
    }

    /**
     *  @brief      Enable SMBus/PMBus default device address of 110 0001b
     *              使能 SMBus/PMBus 默认设备地址匹配（地址解析协议）。
     *
     *  Used for Address Resolution Protocol. When enabled, default device address
     *  of 110 0001b is always matched by the address match logic.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enableDefaultDeviceAddress(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR |= UNICOMMI2CT_CTR_EN_DEFDEVADR_ENABLE;
    }

    /**
     *  @brief      Disable wakeup
     *              禁用低功耗唤醒。
     *
     *  When disabled, the is not allowed to clock stretch on START
     *  detection.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableWakeup(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR &= ~(UNICOMMI2CT_CTR_WUEN_MASK);
    }

