zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommi2ct.h
    /**
     *  @brief      Checks if wakeup is enabled
     *              检查低功耗唤醒是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If wakeup is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true   if wakeup is enabled
     *  @retval     false  if wakeup disabled
     */
    __STATIC_INLINE bool DL_I2CT_isWakeupEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->CTR & UNICOMMI2CT_CTR_WUEN_MASK) ==
                UNICOMMI2CT_CTR_WUEN_ENABLE);
    }

    /**
     *  @brief      Enable wakeup
     *              使能低功耗唤醒（建议同时使能时钟拉伸）。
     *
     *  Enables low-power wake-up, however it is recommended to enable clock
     *  stretching to stretch the clock while the module is waking up.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @sa         DL_I2CT_enableClockStretching
     */
    __STATIC_INLINE void DL_I2CT_enableWakeup(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR |= UNICOMMI2CT_CTR_WUEN_ENABLE;
    }

    /**
     *  @brief      Disable target
     *              禁用 I2CT 目标设备。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disable(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR &= ~(UNICOMMI2CT_CTR_ENABLE_MASK);
    }

    /**
     *  @brief      Checks if target is enabled
     *              检查 I2CT 目标设备是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If functionality is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if functionality is enabled
     *  @retval     false if functionality is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->CTR & UNICOMMI2CT_CTR_ENABLE_MASK) ==
                UNICOMMI2CT_CTR_ENABLE_ENABLE);
    }

    /**
     *  @brief      Enable target
     *              使能 I2CT 目标设备。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enable(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR |= UNICOMMI2CT_CTR_ENABLE_ENABLE;
    }

    /**
     *  @brief      Disable general call address of 000 0000b
     *              禁用广播呼叫地址匹配。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableGeneralCall(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR &= ~(UNICOMMI2CT_CTR_GENCALL_MASK);
    }

    /**
     *  @brief      Checks if general call address of 000 0000b is enabled
     *              检查广播呼叫地址匹配是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If general call is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if general call is enabled
     *  @retval     false if general call is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isGeneralCallEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->CTR & UNICOMMI2CT_CTR_GENCALL_MASK) ==
                UNICOMMI2CT_CTR_GENCALL_ENABLE);
    }

    /**
     *  @brief      Enable usage of general call address of 000 0000b
     *              使能广播呼叫地址匹配。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enableGeneralCall(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->CTR |= UNICOMMI2CT_CTR_GENCALL_ENABLE;
    }

    /**
     *  @brief      Get status of I2CT bus controller for target
     *              获取 I2CT 总线状态。
     *
     *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
     *                              参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Status of I2CT bus controller for target
     *              返回值：状态寄存器值（@ref DL_I2CT_STATUS 位掩码）。
     *
     *  @retval     Bitwise OR of @ref DL_I2CT_STATUS
     */
    __STATIC_INLINE uint32_t DL_I2CT_getStatus(UNICOMM_Inst_Regs *unicomm)
    {
        return (unicomm->i2ct->SR);
    }

    /**
     *  @brief      Get byte of data from UNICOMMI2CT
     *              从 RX FIFO 读取 1 字节数据。
     *
     *  If using FIFO, it is first byte from the RX FIFO.
     *
     *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
     *                              参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Last received byte of data
     *              返回值：接收到的字节数据。
     *
     *  @retval     [0x00, 0xff]
     */
    __STATIC_INLINE uint8_t DL_I2CT_receiveData(UNICOMM_Inst_Regs *unicomm)
    {
        return (uint8_t)(unicomm->i2ct->RXDATA & UNICOMMI2CT_RXDATA_DATA_MASK);
    }

    /**
     *  @brief      Set next byte to be transferred during the next transaction
     *              向 TX FIFO 写入 1 字节待发送数据。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  data    Byte of data to be transferred during the next
     *                      transaction. [0x00, 0xff]
     *                      参数：待发送字节。
     */
    __STATIC_INLINE void DL_I2CT_transmitData(
        UNICOMM_Inst_Regs *unicomm, uint8_t data)
    {
        unicomm->i2ct->TTXDATA = data;
    }

    /**
     *  @brief      Disable ACK override
     *              禁用 ACK 覆盖模式（自动应答）。
     *
     *  Disable manual ACK override to automatically ACK all received bytes until
     *  the RX FIFO is full.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableACKOverride(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->ACKCTL &= ~(UNICOMMI2CT_ACKCTL_ACKOEN_MASK);
    }

    /**
     *  @brief      Checks if ACK override is enabled
     *              检查 ACK 覆盖模式是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If ACK override is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if ACK override is enabled
     *  @retval     false if ACK override is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isACKOverrideEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->ACKCTL & UNICOMMI2CT_ACKCTL_ACKOEN_MASK) ==
                UNICOMMI2CT_ACKCTL_ACKOEN_ENABLE);
    }

    /**
     *  @brief      Enable ACK override
     *              使能 ACK 覆盖模式，由固件决定 ACK/NACK。
     *
     *  When manual ACK override is enabled, the I2CT SCL is pulled low after
     *  the last data is received until the ACK override value (through
     *  @ref DL_I2CT_setACKOverrideValue) is written.
     *  Disable manual ACK override to automatically ACK all received bytes until
     *  the RX FIFO is full.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enableACKOverride(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->ACKCTL |= UNICOMMI2CT_ACKCTL_ACKOEN_ENABLE;
    }

    /**
     *  @brief      Get acknowledge override value
     *              获取 ACK 覆盖值。
     *
     *  @note for General Call this bit will be ignored if set to NACK and
     *  continues to receive data.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     What type of response will be generated
     *              返回值：应答覆盖值枚举。
     *
     *  @retval     One of @ref DL_I2CT_RESPONSE_OVERRIDE_VALUE.
     */
    __STATIC_INLINE DL_I2CT_RESPONSE_OVERRIDE_VALUE DL_I2CT_getACKOverrideValue(
        UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t value = unicomm->i2ct->ACKCTL & UNICOMMI2CT_ACKCTL_ACKOVAL_MASK;

        return (DL_I2CT_RESPONSE_OVERRIDE_VALUE)(value);
    }

    /**
     *  @brief      Set acknowledge override value
     *              设置 ACK 覆盖值（ACK 或 NACK）。
     *
     *  @note for General Call this bit will be ignored if set to NACK and
     *  continues to receive data.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  value   Indicates what type of response will be generated.
     *                      One of @ref DL_I2CT_RESPONSE_OVERRIDE_VALUE.
     *                      参数：应答覆盖值。
     *
     *  @sa         DL_I2CT_enableACKOverride
     */
    __STATIC_INLINE void DL_I2CT_setACKOverrideValue(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_RESPONSE_OVERRIDE_VALUE value)
    {
        DL_Common_updateReg(&unicomm->i2ct->ACKCTL, (uint32_t)value,
                            UNICOMMI2CT_ACKCTL_ACKOVAL_MASK);
    }

    /**
     *  @brief      Disable ACK override on Start Condition
     *              禁用 START 条件后的 ACK 覆盖。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableACKOverrideOnStart(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->ACKCTL &= ~(UNICOMMI2CT_ACKCTL_ACKOEN_ON_START_MASK);
    }

    /**
     *  @brief      Checks if ACK override on Start condition is enabled
     *              检查 START 条件后的 ACK 覆盖是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If ACK override on Start condition is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if ACK override on Start condition is enabled
     *  @retval     false if ACK override on Start condition is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isACKOverrideOnStartEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return (
            (unicomm->i2ct->ACKCTL & UNICOMMI2CT_ACKCTL_ACKOEN_ON_START_MASK) ==
            UNICOMMI2CT_ACKCTL_ACKOEN_ON_START_ENABLE);
    }

    /**
     *  @brief      Enable ACK override on Start condition
     *              使能 START 条件后自动启用 ACK 覆盖。
     *
     *  When enabled, this bit will automatically turn on the ACKOEN field
     *  following a Start condition.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @sa                 DL_I2CT_enableACKOverride
     */
    __STATIC_INLINE void DL_I2CT_enableACKOverrideOnStart(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->ACKCTL |= UNICOMMI2CT_ACKCTL_ACKOEN_ON_START_ENABLE;
    }

    /**
     *  @brief      Disable ACK override when SMBus/PMBus PEC is next byte
     *              禁用 PEC 字节前的 ACK 覆盖。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableACKOverrideOnPECNext(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->ACKCTL &= ~(UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECNEXT_MASK);
    }

    /**
     *  @brief      Checks if ACK override when SMBus/PMBus PEC is next byte
     *              is enabled
     *              检查 PEC 字节前的 ACK 覆盖是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If ACK override when PEC is next byte is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if ACK override when PEC is next byte is enabled
     *  @retval     false if ACK override when PEC is next byte is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isACKOverrideOnPECNextEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return (
            (unicomm->i2ct->ACKCTL & UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECNEXT_MASK) ==
            UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECNEXT_ENABLE);
    }

    /**
     *  @brief      Enable ACK override when SMBus/PMBus PEC is next byte
     *              使能 PEC 字节前自动启用 ACK 覆盖。
     *
     *  When enabled, this bit will automatically turn on the ACKOEN field
     *  following the ACK/NACK of the byte received just prior to the PEC byte.
     *  Note that when ACKOEN is set, the PEC byte will not automatically be
     *  ACKed/NACKed by the state machine and FW must perform this function by
     *  writing SLAVE_SACKCTL.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @sa                 DL_I2CT_enableACKOverride
     */
    __STATIC_INLINE void DL_I2CT_enableACKOverrideOnPECNext(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->ACKCTL |= UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECNEXT_ENABLE;
    }

    /**
     *  @brief      Disable ACK override when SMBus/PMBus PEC is next byte
     *              禁用 PEC 完成后的 ACK 覆盖。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableACKOverrideOnPECDone(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->ACKCTL &= ~(UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECDONE_MASK);
    }

    /**
     *  @brief      Checks if ACK override when SMBus/PMBus PEC is next byte
     *              is enabled
     *              检查 PEC 完成后的 ACK 覆盖是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If ACK override when PEC is next byte is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if ACK override when PEC is next byte is enabled
     *  @retval     false if ACK override when PEC is next byte is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isACKOverrideOnPECDoneEnabled(
        UNICOMM_Inst_Regs *unicomm)
    {
        return (
            (unicomm->i2ct->ACKCTL & UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECDONE_MASK) ==
            UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECDONE_ENABLE);
    }

    /**
     *  @brief      Enable ACK override when SMBus/PMBus PEC is done
     *              使能 PEC 完成后自动启用 ACK 覆盖。
     *
     *  When enabled, this bit will automatically turn on the ACKOEN field
     * following the ACK/NACK of the received PEC byte.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @sa                 DL_I2CT_enableACKOverride
     */
    __STATIC_INLINE void DL_I2CT_enableACKOverrideOnPECDone(
        UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->ACKCTL |= UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECDONE_ENABLE;
    }

    /**
     *  @brief      Get the SMBus/PMBus Packet Error Checking (PEC) count
     *              value
     *              获取 PEC 计数预设值。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The value the PEC count is set to
     *              返回值：PEC 计数预设值。
     *
     *  @retval     Value between [0x0, 0x01FF]
     */
    __STATIC_INLINE uint32_t DL_I2CT_getPECCountValue(UNICOMM_Inst_Regs *unicomm)
    {
        return (unicomm->i2ct->PECCTL & UNICOMMI2CT_PECCTL_PECCNT_MASK);
    }

    /**
     *  @brief      Set the SMBus/PMBus Packet Error Checking (PEC) count
     *              value
     *              设置 PEC 计数预设值。
     *
     *  When this field is non zero, the number of I2CT data bytes are counted.
     *  Refer to the device TRM for more details.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  count   The value to set the PEC count to.
     *                      Value between [0x0, 0x01FF]
     *                      参数：PEC 计数值。
     */
    __STATIC_INLINE void DL_I2CT_setPECCountValue(
        UNICOMM_Inst_Regs *unicomm, uint32_t count)
    {
        DL_Common_updateReg(
            &unicomm->i2ct->PECCTL, count, UNICOMMI2CT_PECCTL_PECCNT_MASK);
    }

    /**
     *  @brief      Disable SMBus/PMBus Packet Error Checking (PEC)
     *              禁用 PEC 校验。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disablePEC(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->PECCTL &= ~(UNICOMMI2CT_PECCTL_PECEN_MASK);
    }

    /**
     *  @brief      Checks if SMBus/PMBus Packet Error Checking (PEC) is
     *              enabled
     *              检查 PEC 校验是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If PEC is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if PEC is enabled
     *  @retval     false if PEC is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isPECEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return ((unicomm->i2ct->PECCTL & UNICOMMI2CT_PECCTL_PECEN_MASK) ==
                UNICOMMI2CT_PECCTL_PECEN_ENABLE);
    }

    /**
     *  @brief      Enable SMBus/PMBus Packet Error Checking (PEC)
     *              使能 PEC 校验，多项式为 x^8 + x^2 + x^1 + 1。
     *
     *  When enabled, the PEC is calculated on all bits accept the Start, Stop, ACK
     *  and NACK. The PEC LSFR and the Byte Counter is set to 0 when the State
     *  Machine is in the IDLE state, which occurs following a Stop or when a
     *  timeout occurs. The Counter is also set to 0 after the PEC byte is sent or
     *  received. Note that the NACK is automatically sent following a PEC byte
     *  that results in a PEC error.
     *  The PEC Polynomial is x^8 + x^2 + x^1 + 1.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     */
    __STATIC_INLINE void DL_I2CT_enablePEC(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->PECCTL |= UNICOMMI2CT_PECCTL_PECEN_ENABLE;
    }

    /**
     *  @brief      Get the current SMBus/PMBus PEC byte count of the state
     *              machine
     *              获取当前 PEC 字节计数。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The current PEC byte count of the state macione
     *              返回值：当前 PEC 字节计数。
     *
     *  @retval     Value between [0x0, 0x01FF]
     */
    __STATIC_INLINE uint32_t DL_I2CT_getCurrentPECCount(UNICOMM_Inst_Regs *unicomm)
    {
        return (unicomm->i2ct->PECSR & UNICOMMI2CT_PECSR_PECBYTECNT_MASK);
    }

    /**
     *  @brief      Get status if SMBus/PMBus PEC was checked in last
     *              transaction
     *              查询上次事务是否进行了 PEC 校验。
     *
     *  The status indicates if the PEC was checked in the transaction that
     *  occurred before the last Stop. Latched on Stop.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Status of PEC checked
     *              返回值：PEC 校验状态。
     *
     *  @retval     One of @ref DL_I2CT_PEC_STATUS
     */
    __STATIC_INLINE DL_I2CT_PEC_STATUS DL_I2CT_getPECCheckedStatus(
        UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t status =
            unicomm->i2ct->PECSR & UNICOMMI2CT_PECSR_PECSTS_CHECK_MASK;

        return (DL_I2CT_PEC_STATUS)(status);
    }

    /**
     *  @brief      Get status if SMBus/PMBus PEC had an error
     *              查询上次事务 PEC 校验是否出错。
     *
     *  The status indicates if a PEC check error occurred in the transaction that
     *  occurred before the last Stop. Latched on Stop.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     Status of PEC error check
     *              返回值：PEC 校验错误状态。
     *
     *  @retval     One of @ref DL_I2CT_PEC_CHECK_ERROR
     */
    __STATIC_INLINE DL_I2CT_PEC_CHECK_ERROR DL_I2CT_getPECCheckError(
        UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t status =
            unicomm->i2ct->PECSR & UNICOMMI2CT_PECSR_PECSTS_ERROR_MASK;

