zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommi2ct.h
        return (DL_I2CT_PEC_CHECK_ERROR)(status);
    }

    /**
     *  @brief      Get TX FIFO threshold level
     *              获取 TX FIFO 中断触发阈值。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @return     Indicates at what fill level in the TX FIFO a threshold will be
     *              generated
     *              返回值：TX FIFO 阈值枚举值。
     *
     *  @retval     One of @ref DL_I2CT_TX_FIFO_LEVEL
     */
    __STATIC_INLINE DL_I2CT_TX_FIFO_LEVEL DL_I2CT_getTXFIFOThreshold(
        UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t level = unicomm->i2ct->IFLS & UNICOMMI2CT_IFLS_TXIFLSEL_MASK;

        return (DL_I2CT_TX_FIFO_LEVEL)(level);
    }

    /**
     *  @brief      Set TX FIFO threshold level
     *              设置 TX FIFO 中断触发阈值。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  level   Indicates at what fill level in the TX FIFO a threshold
     *                      will be generated.
     *                      One of @ref DL_I2CT_TX_FIFO_LEVEL.
     *                      参数：TX FIFO 阈值枚举值。
     */
    __STATIC_INLINE void DL_I2CT_setTXFIFOThreshold(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_TX_FIFO_LEVEL level)
    {
        DL_Common_updateReg(&unicomm->i2ct->IFLS, (uint32_t)level,
                            (uint32_t)UNICOMMI2CT_IFLS_TXIFLSEL_MASK);
    }

    /**
     *  @brief      Get RX FIFO threshold level
     *              获取 RX FIFO 中断触发阈值。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @return     Indicates at what fill level in the RX FIFO a threshold will be
     *              generated
     *              返回值：RX FIFO 阈值枚举值。
     *
     *  @retval     One of @ref DL_I2CT_RX_FIFO_LEVEL
     */
    __STATIC_INLINE DL_I2CT_RX_FIFO_LEVEL DL_I2CT_getRXFIFOThreshold(
        UNICOMM_Inst_Regs *unicomm)
    {
        uint32_t level = unicomm->i2ct->IFLS & UNICOMMI2CT_IFLS_RXIFLSEL_MASK;

        return (DL_I2CT_RX_FIFO_LEVEL)(level);
    }

    /**
     *  @brief      Set RX FIFO threshold level
     *              设置 RX FIFO 中断触发阈值。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *  @param[in]  level   Indicates at what fill level in the RX FIFO a threshold
     *                      will be generated.
     *                      One of @ref DL_I2CT_RX_FIFO_LEVEL.
     *                      参数：RX FIFO 阈值枚举值。
     */
    __STATIC_INLINE void DL_I2CT_setRXFIFOThreshold(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_RX_FIFO_LEVEL level)
    {
        DL_Common_updateReg(&unicomm->i2ct->IFLS, (uint32_t)level,
                            UNICOMMI2CT_IFLS_RXIFLSEL_MASK);
    }

    /**
     *  @brief      Enable I2CT interrupts
     *              使能 I2CT 中断。
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                             参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
     *                             @ref DL_I2CT_INTERRUPT.
     *                             参数：中断位掩码。
     */
    __STATIC_INLINE void DL_I2CT_enableInterrupt(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        unicomm->i2ct->CPU_INT.IMASK |= interruptMask;
    }

    /**
     *  @brief      Disable I2CT interrupts
     *              禁用 I2CT 中断。
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                             参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to disable. Bitwise OR of
     *                             @ref DL_I2CT_INTERRUPT.
     *                             参数：中断位掩码。
     */
    __STATIC_INLINE void DL_I2CT_disableInterrupt(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        unicomm->i2ct->CPU_INT.IMASK &= ~(interruptMask);
    }

    /**
     *  @brief      Check which I2CT interrupts are enabled
     *              查询已使能的 I2CT 中断。
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                             参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2CT_INTERRUPT.
     *                             参数：中断位掩码。
     *
     *  @return     Which of the requested I2CT interrupts are enabled
     *              返回值：已使能的中断位。
     *
     *  @retval     Bitwise OR of @ref DL_I2CT_INTERRUPT values
     */
    __STATIC_INLINE uint32_t DL_I2CT_getEnabledInterrupts(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        return (unicomm->i2ct->CPU_INT.IMASK & interruptMask);
    }

    /**
     *  @brief      Check interrupt flag of enabled I2CT interrupts
     *              查询已使能中断的挂起状态（屏蔽后）。
     *
     *  Checks if any of the I2CT interrupts that were previously enabled are
     *  pending.
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                             参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2CT_INTERRUPT.
     *                             参数：中断位掩码。
     *
     *  @return     Which of the requested I2CT interrupts are pending
     *              返回值：挂起的中断位。
     *
     *  @retval     Bitwise OR of @ref DL_I2CT_INTERRUPT values
     *
     *  @sa         DL_I2CT_enableInterrupt
     */
    __STATIC_INLINE uint32_t DL_I2CT_getEnabledInterruptStatus(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        return (unicomm->i2ct->CPU_INT.MIS & interruptMask);
    }

    /**
     *  @brief      Check interrupt flag of any I2CT interrupt
     *              查询原始中断挂起状态（不受屏蔽影响）。
     *
     *  Checks if any of the I2CT interrupts are pending. Interrupts do not have to
     *  be previously enabled.
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                             参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2CT_INTERRUPT.
     *                             参数：中断位掩码。
     *
     *  @return     Which of the requested I2CT interrupts are pending
     *              返回值：挂起的中断位。
     *
     *  @retval     Bitwise OR of @ref DL_I2CT_INTERRUPT values
     */
    __STATIC_INLINE uint32_t DL_I2CT_getRawInterruptStatus(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        return (unicomm->i2ct->CPU_INT.RIS & interruptMask);
    }

    /**
     *  @brief      Get highest priority pending I2CT interrupt
     *              获取最高优先级的挂起中断索引。
     *
     *  Checks if any of the I2CT interrupts are pending. Interrupts do not have to
     *  be previously enabled.
     *
     *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
     *                       参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The highest priority pending I2CT interrupt
     *              返回值：中断索引枚举值。
     *
     *  @retval     One of @ref DL_I2CT_IIDX
     */
    __STATIC_INLINE DL_I2CT_IIDX DL_I2CT_getPendingInterrupt(
        UNICOMM_Inst_Regs *unicomm)
    {
        return ((DL_I2CT_IIDX)unicomm->i2ct->CPU_INT.IIDX);
    }

    /**
     *  @brief      Clear pending I2CT interrupts
     *              清除指定的中断标志。
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the
     *                             peripheral
     *                             参数：UNICOMM 外设寄存器实例。
     *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
     *                             @ref DL_I2CT_INTERRUPT.
     *                             参数：待清除的中断位掩码。
     */
    __STATIC_INLINE void DL_I2CT_clearInterruptStatus(
        UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
    {
        unicomm->i2ct->CPU_INT.ICLR = interruptMask;
    }

    /**
     *  @brief Enables I2CT interrupt for triggering DMA events
     *         使能 I2CT DMA 事件触发中断。
     *
     * Enables the I2CT interrupt to be used as the condition to generate an
     * event to directly trigger the DMA.
     *
     * Each event publisher @ref DL_I2CT_EVENT_ROUTE can set any one of
     * @ref DL_I2CT_DMA_INTERRUPT.
     *
     * @note Only one interrupt source should be enabled at a time.
     *
     *  @param[in]  unicomm        Pointer to the register overlay for the peripheral
     *                             参数：UNICOMM 外设寄存器实例。
     *  @param[in]  index      Specifies the register event publisher to configure
     *                         参数：事件路由选择。
     *  @param[in]  interrupt  Interrupt to enable as the trigger condition for
     *                         the DMA. One of @ref DL_I2CT_DMA_INTERRUPT.
     *                         参数：DMA 触发中断源。
     */
    __STATIC_INLINE void DL_I2CT_enableDMAEvent(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_EVENT_ROUTE index, uint32_t interrupt)
    {
        switch (index)
        {
        case DL_I2CT_EVENT_ROUTE_1:
            unicomm->i2ct->DMA_TRIG1.IMASK = interrupt;
            break;
        case DL_I2CT_EVENT_ROUTE_2:
            unicomm->i2ct->DMA_TRIG0.IMASK = interrupt;
            break;
        default:
            break;
        }
    }

    /**
     *  @brief Disables I2CT interrupt from triggering DMA events
     *         禁用 I2CT DMA 事件触发中断。
     *
     * Disables the I2CT interrupt from being used as the condition to generate an
     * event to directly trigger the DMA.
     *
     * Each event publisher @ref DL_I2CT_EVENT_ROUTE can set any one of
     * @ref DL_I2CT_DMA_INTERRUPT.
     *
     *  @param[in]  unicomm        Pointer to the register overlay for the peripheral
     *                             参数：UNICOMM 外设寄存器实例。
     *  @param[in]  index      Specifies the register event publisher to configure
     *                         参数：事件路由选择。
     *  @param[in]  interrupt  Interrupt to disable as the trigger condition for
     *                         the DMA. One of @ref DL_I2CT_DMA_INTERRUPT.
     *                         参数：DMA 触发中断源。
     */
    __STATIC_INLINE void DL_I2CT_disableDMAEvent(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_EVENT_ROUTE index, uint32_t interrupt)
    {
        switch (index)
        {
        case DL_I2CT_EVENT_ROUTE_1:
            unicomm->i2ct->DMA_TRIG1.IMASK &= ~(interrupt);
            break;
        case DL_I2CT_EVENT_ROUTE_2:
            unicomm->i2ct->DMA_TRIG0.IMASK &= ~(interrupt);
            break;
        default:
            break;
        }
    }

    /**
     *  @brief Check which I2CT interrupt for DMA receive events is enabled
     *         查询已使能的 DMA 事件中断。
     *
     *  This API checks the event publisher register as selected by
     *  @ref DL_I2CT_EVENT_ROUTE, which are used for triggering the DMA for
     *  Controller or and receive or transmit events.
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *  @param[in]  index          Specifies the register event publisher to configure
     *                             参数：事件路由选择。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2CT_DMA_INTERRUPT.
     *                             参数：中断位掩码。
     *
     *  @note Only one interrupt source should be enabled at a time.
     *
     *  @return     The requested I2CT interrupt status
     *              返回值：已使能的 DMA 中断位。
     *
     *  @retval     One of @ref DL_I2CT_DMA_INTERRUPT
     */
    __STATIC_INLINE uint32_t DL_I2CT_getEnabledDMAEvents(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_EVENT_ROUTE index,
        uint32_t interruptMask)
    {
        volatile uint32_t *pReg = &unicomm->i2ct->DMA_TRIG1.IMASK;

