zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_unicommi2ct.h
        return ((*(pReg + (uint32_t)index) & interruptMask));
    }

    /**
     *  @brief Check interrupt flag of enabled I2CT interrupt for DMA event
     *         查询已使能 DMA 事件中断的挂起状态。
     *
     *  Checks if any of the I2CT interrupts for the DMA receive event that were
     *  previously enabled are pending.
     *  This API checks the event publisher register as selected by
     *  @ref DL_I2CT_EVENT_ROUTE, which are used for triggering the DMA for
     *  Controller or and receive or transmit events.
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *  @param[in]  index          Specifies the register event publisher to configure
     *                             参数：事件路由选择。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2CT_DMA_INTERRUPT.
     *                             参数：中断位掩码。
     *
     *  @note Only one interrupt source should be enabled at a time.
     *
     *  @return     The requested I2CT interrupt status
     *              返回值：挂起的 DMA 中断位。
     *
     *  @retval     One of @ref DL_I2CT_DMA_INTERRUPT
     *
     *  @sa         DL_I2CT_enableDMAEvent
     */
    __STATIC_INLINE uint32_t DL_I2CT_getEnabledDMAEventStatus(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_EVENT_ROUTE index,
        uint32_t interruptMask)
    {
        const volatile uint32_t *pReg = &unicomm->i2ct->DMA_TRIG1.MIS;

        return ((*(pReg + (uint32_t)index) & interruptMask));
    }

    /**
     *  @brief Check interrupt flag of any I2CT interrupt for DMA event
     *         查询 DMA 事件原始中断挂起状态（不受屏蔽影响）。
     *
     *  Checks if any of the I2CT interrupts for DMA receive event are pending.
     *  Interrupts do not have to be previously enabled.
     *  This API checks the event publisher register as selected by
     *  @ref DL_I2CT_EVENT_ROUTE, which are used for triggering the DMA for
     *  Controller or and receive or transmit events.
     *
     *  @param[in]  unicomm            Pointer to the register overlay for the peripheral
     *                                 参数：UNICOMM 外设寄存器实例。
     *  @param[in]  index          Specifies the register event publisher to configure
     *                             参数：事件路由选择。
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_I2CT_DMA_INTERRUPT.
     *                             参数：中断位掩码。
     *
     *  @return     Which of the requested I2CT interrupts are pending
     *              返回值：挂起的 DMA 中断位。
     *
     *  @retval     Bitwise OR of @ref DL_I2CT_DMA_INTERRUPT values
     */
    __STATIC_INLINE uint32_t DL_I2CT_getRawDMAEventStatus(
        UNICOMM_Inst_Regs *unicomm, DL_I2CT_EVENT_ROUTE index,
        uint32_t interruptMask)
    {
        const volatile uint32_t *pReg = &unicomm->i2ct->DMA_TRIG1.RIS;

        return ((*(pReg + (uint32_t)index) & interruptMask));
    }

    /**
     *  @brief      Get the Timeout Counter A value
     *              获取超时计数器 A 预设值。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The Timeout A counter value
     *              返回值：超时 A 预设值。
     *
     *  @retval     Value between [0x0, 0xFF]
     */
    __STATIC_INLINE uint32_t DL_I2CT_getTimeoutACount(UNICOMM_Inst_Regs *unicomm)
    {
        return (unicomm->i2ct->TIMEOUT_CTL & UNICOMMI2CT_TIMEOUT_CTL_TCNTLA_MASK);
    }

    /**
     *  @brief      Set the Timeout Counter A value
     *              设置超时计数器 A 预设值（用于 SCL 低电平检测）。
     *
     *  Timeout A is used for SCL low detection. This field contains the upper 8
     *  bits of a 12-bit pre-load value for the Timeout A count.
     *  NOTE: The value of the counter must be greater than 1 to enable the
     *  timeout. Each count is equal to 520 times the timeout period of the
     *  functional clock. For example, with 8MHz functional clock and a
     *  100KHz operating I2CT clock, one timeout period will be equal to
     *  (1 / 8MHz) * 520 = 65us.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the
     *                      peripheral
     *                      参数：UNICOMM 外设寄存器实例。
     *  @param[in]  count   The value to set the Timeout A counter to.
     *                      Value between [0x0, 0xFF]
     *                      参数：超时 A 预设值。
     */
    __STATIC_INLINE void DL_I2CT_setTimeoutACount(
        UNICOMM_Inst_Regs *unicomm, uint32_t count)
    {
        DL_Common_updateReg(&unicomm->i2ct->TIMEOUT_CTL, count,
                            UNICOMMI2CT_TIMEOUT_CTL_TCNTLA_MASK);
    }

    /**
     *  @brief      Disable Timeout Counter A
     *              禁用超时计数器 A。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableTimeoutA(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->TIMEOUT_CTL &= ~(UNICOMMI2CT_TIMEOUT_CTL_TCNTAEN_MASK);
    }

    /**
     *  @brief      Checks if Timeout Counter A is enabled
     *              检查超时计数器 A 是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If Timeout Counter A is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if Timeout Counter A is enabled
     *  @retval     false if Timeout Counter A is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isTimeoutAEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return (
            (unicomm->i2ct->TIMEOUT_CTL & UNICOMMI2CT_TIMEOUT_CTL_TCNTAEN_MASK) ==
            UNICOMMI2CT_TIMEOUT_CTL_TCNTAEN_ENABLE);
    }

    /**
     *  @brief      Enable Timeout Counter A
     *              使能超时计数器 A。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enableTimeoutA(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->TIMEOUT_CTL |= UNICOMMI2CT_TIMEOUT_CTL_TCNTAEN_ENABLE;
    }

    /**
     *  @brief      Get the current Timer Counter A value
     *              获取超时计数器 A 当前值。
     *
     *  This field contains the upper 8 bits of a 12-bit current counter for
     *  Timeout Counter A.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The Timeout A counter value
     *              返回值：超时 A 当前计数值。
     *
     *  @retval     Value between [0x0, 0xFF]
     */
    __STATIC_INLINE uint32_t DL_I2CT_getCurrentTimeoutACounter(
        UNICOMM_Inst_Regs *unicomm)
    {
        return (unicomm->i2ct->TIMEOUT_CNT & UNICOMMI2CT_TIMEOUT_CNT_TCNTA_MASK);
    }

    /**
     *  @brief      Get the Timeout Counter B value
     *              获取超时计数器 B 预设值。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The Timeout B counter value
     *              返回值：超时 B 预设值。
     *
     *  @retval     Value between [0x0, 0xFF]
     */
    __STATIC_INLINE uint32_t DL_I2CT_getTimeoutBCount(UNICOMM_Inst_Regs *unicomm)
    {
        return (
            (unicomm->i2ct->TIMEOUT_CTL & UNICOMMI2CT_TIMEOUT_CTL_TCNTLB_MASK) >>
            UNICOMMI2CT_TIMEOUT_CTL_TCNTLB_OFS);
    }

    /**
     *  @brief      Set the Timeout Counter B value
     *              设置超时计数器 B 预设值（用于 SCL 高电平检测）。
     *
     *  Timeout B is used for SCL high detection. This field contains the upper 8
     *  bits of a 12-bit pre-load value for the Timeout A count.
     *  NOTE: The value of the counter must be greater than 1 to enable the
     *  timeout. Each count is equal to 1* clock period. For example, with 10MHz
     *  functional clock one timeout period will be equal to 1 * 10ns.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the
     *                      peripheral
     *                      参数：UNICOMM 外设寄存器实例。
     *  @param[in]  count   The value to set the Timeout A counter to.
     *                      Value between [0x0, 0xFF]
     *                      参数：超时 B 预设值。
     */
    __STATIC_INLINE void DL_I2CT_setTimeoutBCount(
        UNICOMM_Inst_Regs *unicomm, uint32_t count)
    {
        DL_Common_updateReg(&unicomm->i2ct->TIMEOUT_CTL,
                            (count << UNICOMMI2CT_TIMEOUT_CTL_TCNTLB_OFS),
                            UNICOMMI2CT_TIMEOUT_CTL_TCNTLB_MASK);
    }

    /**
     *  @brief      Disable Timeout Counter B
     *              禁用超时计数器 B。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_disableTimeoutB(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->TIMEOUT_CTL &= ~(UNICOMMI2CT_TIMEOUT_CTL_TCNTBEN_MASK);
    }

    /**
     *  @brief      Checks if Timeout Counter B is enabled
     *              检查超时计数器 B 是否已使能。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     If Timeout Counter B is enabled
     *              返回值：是否已使能。
     *
     *  @retval     true if Timeout Counter B is enabled
     *  @retval     false if Timeout Counter B is disabled
     */
    __STATIC_INLINE bool DL_I2CT_isTimeoutBEnabled(UNICOMM_Inst_Regs *unicomm)
    {
        return (
            (unicomm->i2ct->TIMEOUT_CTL & UNICOMMI2CT_TIMEOUT_CTL_TCNTBEN_MASK) ==
            UNICOMMI2CT_TIMEOUT_CTL_TCNTBEN_ENABLE);
    }

    /**
     *  @brief      Enable Timeout Counter B
     *              使能超时计数器 B。
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     */
    __STATIC_INLINE void DL_I2CT_enableTimeoutB(UNICOMM_Inst_Regs *unicomm)
    {
        unicomm->i2ct->TIMEOUT_CTL |= UNICOMMI2CT_TIMEOUT_CTL_TCNTBEN_ENABLE;
    }

    /**
     *  @brief      Get the current Timer Counter B value
     *              获取超时计数器 B 当前值。
     *
     *  This field contains the upper 8 bits of a 12-bit current counter for
     *  Timeout Counter B.
     *
     *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
     *                          参数：UNICOMM 外设寄存器实例。
     *
     *  @return     The Timeout B counter value
     *              返回值：超时 B 当前计数值。
     *
     *  @retval     Value between [0x0, 0xFF]
     */
    __STATIC_INLINE uint32_t DL_I2CT_getCurrentTimeoutBCounter(
        UNICOMM_Inst_Regs *unicomm)
    {
        return (unicomm->i2ct->TIMEOUT_CNT & UNICOMMI2CT_TIMEOUT_CNT_TCNTB_MASK);
    }

#ifdef __cplusplus
}
#endif

#endif /* __MCU_HAS_UNICOMMI2CT__ */

#endif /* ti_dl_dl_unicommi2ct__include */
/** @}*/
